tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'


#
# Comment or uncomment if you want to adapt your installation
#

# OSX Terminal stuff that will make your life easier
brew 'bash'
brew 'coreutils'
brew 'curl'
brew 'git'
brew 'git-lfs'
brew 'n'
brew 'trash'
brew 'wget'
brew 'ack'
brew 'freetype'
brew 'git'
brew 'graphviz'
brew 'imagemagick'
brew 'libpng'
brew 'pkg-config'
brew 'rename'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'jenv'
# jEnv is a command line tool to help you forget how to set the JAVA_HOME environment variable

#
# system tools
#
cask 'little-snitch'

cask 'osxfuse'
# let you mount windows drives and write on it

cask '1password'
# maintain your passwords

cask 'appcleaner'
# remove apps with system setting files

cask 'iterm2'
# nicer terminal

cask 'recordit'
# record a part of the screen as gif

cask 'rightfont'
# good font management for osx

cask 'fontstand'
# try expensive fonts for 1h

cask 'spectacle'
# rearrange your OSX windows with shortcuts

cask 'the-unarchiver'
# better Unarchiver for OSX (supports more formats but works the same)

# extends quicklook so it supports more formats
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'


#
# Text & Code
#

mas 'Xcode', id: 497799835
# OSX Coding tools and IOS Simulators

cask 'java'
cask 'phpstorm'
cask 'intellij-idea'
cask 'sublime-text'
cask 'atom'
cask 'visual-studio-code'
cask 'visual-paradigm'
cask 'dash'
cask 'typora'
# most powerful ide for php and other programming languages

#cask 'docker'
#cask 'kitematic'
cask 'vmware-fusion'
cask 'vagrant'
cask 'vagrant-manager'
cask 'vagrant-vmware-utility'
# install homestead manually
# host for local development

#
# Internet stuff
#

cask 'google-chrome'
cask 'firefox'
cask 'brave'
cask 'torbrowser'

cask 'spotify'

#
# Collaboration & communication
#

cask 'gitter'
cask 'teamviewer'
cask 'joinme'
cask 'skype'
cask 'github'
cask 'fork'
cask 'whatsapp'
cask 'telegram-desktop'
cask 'discord'
cask 'dropbox'
cask 'box-drive'
cask 'box-sync'

# MS Office & OpenOffice
cask 'microsoft-office'
cask 'openoffice'

#
# Creative stuff & image tools
#

cask 'imagealpha'
# create small transparent PNG

cask 'imageoptim'
# PNG optimization


#
# Multimedia & Tools
#

cask 'daisydisk'
cask 'parsec'
cask 'ableton-live'
cask 'theine'
cask 'adobe-acrobat-pro'
cask 'adobe-creative-cloud'
cask 'adobe-creative-cloud-cleaner-tool'
cask 'capture-one'
cask 'moneymoney'
cask 'jdownloader'
cask 'fantastical'
cask 'cloudmounter'
cask 'coconutbattery'
cask 'etrecheck'
cask 'forklift'
cask 'gpg-suite'
cask 'totals'
cask 'grandtotals'
cask 'timings'
cask 'namechanger'
cask 'handbreak'
cask 'mkchromecast'
cask 'vlc'
cask 'lingon-x'
cask 'kodi'
cask 'tuneinstructor'
cask 'imageoptim'
cask 'quitter'
cask 'certbot'
cask 'paw'
cask 'advancedcolors'
cask 'padbury-clock'
cask 'sketch'
cask 'staruml'
#cask 'keybase'


